package by.htp.branching01.main;

/* Составить программу сравнения введенного числа а и цифры 3. Вывести на экран слово «yes»,
 *  если число а меньше 3; если больше, то вывести слово «no». 
 */
 

public class Task03 {
	
	public static void main(String[] args) {
		
		int a = 1;
		
		if(a < 3) {
			
			System.out.println("yes");
			
		}else {
			
			System.out.println("no");
		}
		
	}
}
