package by.htp.branching01.main;

/* Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 - вывести на экран "yes", 
 * в противном случае - слово "no".
 */

public class Task02 {

	public static void main(String[] args) {
		
		int a = 1;
		int b = 2;
		
		if(a < b) {
			
			System.out.println("yes");
			
		}else {
			
			System.out.println("no");
		}
		// TODO Auto-generated method stub

	}

}
