package by.htp.linear01.main;

// Дан прямоугольник, ширина которога в два раза меньше длины. Найти площадь прямоугольника
// a - длина
// b - шириана
// s - площадь

public class Task07 {
	
	public static void main(String[] args) {
		
		int a = 2;
		int b = a / 2;
		int s = a * b;
		
		System.out.println(" a = " + a);
		System.out.println(" b = a / 2 = " + b);
		System.out.println(" s = a * b = " + s);
	}
	
	

}
