package by.htp.linear01.main;

// Написать программу, которая выводит на экран первые четыре степени числа π  

public class Task15 {
	
	public static void main(String[] args) {
		
		int x;
		
		for (x = 1; x < 5; x++) {
			
			System.out.println(Math.pow(Math.PI, x));
			
		}
		
	}

}
