package by.htp.linear01.main;

// Написать код для решения задачи. В n малых бидонах 80 л молока. 
// Сколько литров молока в m больших бидонах, если в каждом большом бидоне на 12 л больше чем в малом?

public class Task06 {
	
	public static void main(String[] args) {
		
		int n;
		int m;
		
		n = 10;
		m = 20;
		
		System.out.println("((80 / n) + 12) * m = " + (((80 / n) + 12) * m) + " л ");
		
	}

}
